In [3]:
import pandas as pd

In [4]:
people = {
    'fname' : ['Suminder', 'Deepinder', 'Nimrat'],
    'lname' : ['Singh', 'Kaur', 'Kaur'],
    'email' : ['suminder.singh@ex.com', 'dkaur@ex.com', 'nkaur@ex.com']
}

new = {
    'Fname' : ['Ankit', 'Reena', 'Vicky'],
    'Lname' : ['Chopra', 'Sidhu', 'Bedi']
}

df1 = pd.DataFrame(people)
df2 = pd.DataFrame(new)

In [5]:
df1

       fname  lname                  email
0   Suminder  Singh  suminder.singh@ex.com
1  Deepinder   Kaur           dkaur@ex.com
2     Nimrat   Kaur           nkaur@ex.com

In [6]:
df1[['tst1', 'tst2']] = df1['email'].str.split('@', expand = True)

In [7]:
df1

       fname  lname                  email            tst1    tst2
0   Suminder  Singh  suminder.singh@ex.com  suminder.singh  ex.com
1  Deepinder   Kaur           dkaur@ex.com           dkaur  ex.com
2     Nimrat   Kaur           nkaur@ex.com           nkaur  ex.com

In [8]:
df1.columns = df1.columns.str.capitalize()

In [9]:
df1

       Fname  Lname                  Email            Tst1    Tst2
0   Suminder  Singh  suminder.singh@ex.com  suminder.singh  ex.com
1  Deepinder   Kaur           dkaur@ex.com           dkaur  ex.com
2     Nimrat   Kaur           nkaur@ex.com           nkaur  ex.com

In [10]:
df1 = df1.append(df2, ignore_index=True, sort=False)

In [11]:
df1

       Fname   Lname                  Email            Tst1    Tst2
0   Suminder   Singh  suminder.singh@ex.com  suminder.singh  ex.com
1  Deepinder    Kaur           dkaur@ex.com           dkaur  ex.com
2     Nimrat    Kaur           nkaur@ex.com           nkaur  ex.com
3      Ankit  Chopra                    NaN             NaN     NaN
4      Reena   Sidhu                    NaN             NaN     NaN
5      Vicky    Bedi                    NaN             NaN     NaN

In [12]:
df1.drop(index = df1.loc[df1['Lname']=='Sidhu'].index)

       Fname   Lname                  Email            Tst1    Tst2
0   Suminder   Singh  suminder.singh@ex.com  suminder.singh  ex.com
1  Deepinder    Kaur           dkaur@ex.com           dkaur  ex.com
2     Nimrat    Kaur           nkaur@ex.com           nkaur  ex.com
3      Ankit  Chopra                    NaN             NaN     NaN
5      Vicky    Bedi                    NaN             NaN     NaN

In [13]:
df1.apply(len, axis=0)

Fname    6
Lname    6
Email    6
Tst1     6
Tst2     6
dtype: int64

In [14]:
df1['Tst3'] = df1['Tst2'].apply(lambda x: str(x)+'fuddu')

In [15]:
df1

,Fname,Lname,Email,Tst1,Tst2,Tst3
0,Suminder,Singh,suminder.singh@ex.com,suminder.singh,ex.com,ex.comfuddu
1,Deepinder,Kaur,dkaur@ex.com,dkaur,ex.com,ex.comfuddu
2,Nimrat,Kaur,nkaur@ex.com,nkaur,ex.com,ex.comfuddu
3,Ankit,Chopra,NaN,NaN,NaN,nanfuddu
4,Reena,Sidhu,NaN,NaN,NaN,nanfuddu
5,Vicky,Bedi,NaN,NaN,NaN,nanfuddu

In [24]:
import numpy as np

df1[['col1', ' col2']] = np.random.randint(1,1000,12).reshape(len(df1.index), 2)

In [25]:
df1

,Fname,Lname,Email,Tst1,Tst2,Tst3,num1,num2,col1,col2
0,Suminder,Singh,suminder.singh@ex.com,suminder.singh,ex.com,ex.comfuddu,320,320,249,336
1,Deepinder,Kaur,dkaur@ex.com,dkaur,ex.com,ex.comfuddu,320,320,891,848
2,Nimrat,Kaur,nkaur@ex.com,nkaur,ex.com,ex.comfuddu,320,320,742,290
3,Ankit,Chopra,NaN,NaN,NaN,nanfuddu,320,320,231,818
4,Reena,Sidhu,NaN,NaN,NaN,nanfuddu,320,320,592,311
5,Vicky,Bedi,NaN,NaN,NaN,nanfuddu,320,320,145,981

In [28]:
df1.drop(columns = ['num1'], inplace=True)

In [29]:
df1

,Fname,Lname,Email,Tst1,Tst2,Tst3,num2,col1,col2
0,Suminder,Singh,suminder.singh@ex.com,suminder.singh,ex.com,ex.comfuddu,320,249,336
1,Deepinder,Kaur,dkaur@ex.com,dkaur,ex.com,ex.comfuddu,320,891,848
2,Nimrat,Kaur,nkaur@ex.com,nkaur,ex.com,ex.comfuddu,320,742,290
3,Ankit,Chopra,NaN,NaN,NaN,nanfuddu,320,231,818
4,Reena,Sidhu,NaN,NaN,NaN,nanfuddu,320,592,311
5,Vicky,Bedi,NaN,NaN,NaN,nanfuddu,320,145,981

In [30]:
df1.drop(index=df1[df1['Lname'] == 'Sidhu'].index)

,Fname,Lname,Email,Tst1,Tst2,Tst3,num2,col1,col2
0,Suminder,Singh,suminder.singh@ex.com,suminder.singh,ex.com,ex.comfuddu,320,249,336
1,Deepinder,Kaur,dkaur@ex.com,dkaur,ex.com,ex.comfuddu,320,891,848
2,Nimrat,Kaur,nkaur@ex.com,nkaur,ex.com,ex.comfuddu,320,742,290
3,Ankit,Chopra,NaN,NaN,NaN,nanfuddu,320,231,818
5,Vicky,Bedi,NaN,NaN,NaN,nanfuddu,320,145,981

In [32]:
df1.apply(len, axis='rows')

Fname    6
Lname    6
Email    6
Tst1     6
Tst2     6
Tst3     6
num2     6
col1     6
 col2    6
dtype: int64

In [33]:
df1.apply(len, axis='columns')

0    9
1    9
2    9
3    9
4    9
5    9
dtype: int64

In [40]:
tst = np.random.randint(1,100,24).reshape(2,2,2,3)

In [41]:
tst

array([[[[38, 18, 87],
         [17, 75, 98]],

        [[48, 65, 64],
         [59, 56, 12]]],


       [[[36, 82, 19],
         [91, 83, 37]],

        [[16,  6, 55],
         [31,  2, 47]]]])